// Напишите прогрумму, которая на вход принимает число и выдает его квадрат (число умноженное само на себя)

Console.WriteLine("Введите число: ");
int number = int.Parse(Console.ReadLine());
int result = number * number;
Console.Write("Квадрат числа " + number + " = " + result);


